---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumberOfLinesParam
source: html/afa8da34-c2ba-169c-8125-210b87e6e1cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumberOfLinesParam Property

"Number of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemNumberOfLinesParam { get; }
```